app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    # if song = Song.find_by(:id => params[:song_id])
    #   @song = song
    # end
    @artist = Artist.find(params[:id])