app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if artist = Artist.find_by_id(params[:artist_id])
        @songs = artist.songs
        @artist = artist
      else
        redirect_to artists_path, alert: "Artist not found"
      end

    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    if params[:artist_id]
      @song = Song.find_by(id: params[:id])
      @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]